jaw0/osj5/src/machdep/arm_cm/stm32/src/usb_otg.c
/*
  Copyright (c) 2018
  Author: Jeff Weisberg <jaw @ tcp4me.com>
  Created: 2018-Apr-15 22:29 (EDT)
  Function: usb otg full-speed + high-speed
*/

/*
  tested on:
	stm32 F4, L4, F7, U5
*/

#include <conf.h>
#include <nstdio.h>
#include <proc.h>
#include <arch.h>
#include <error.h>
#include <dev.h>
#include <stm32.h>
#include <gpio.h>
#include <usbdef.h>
#include <usbotg_impl.h>
#include <usbotg.h>
#include <usbd.h>
#include <userint.h>

#if defined(USB_OTG_TRACE) || defined(USB_TRACE)
#  define TRACE
#endif
#include <trace.h>



#define CONTROL_SIZE	64

#ifdef RX_FIFO_SIZE
#  define RX_FIFO_FS_SIZE RX_FIFO_SIZE
#  define RX_FIFO_HS_SIZE RX_FIFO_SIZE
#else
#  define RX_FIFO_FS_SIZE 256
#  define RX_FIFO_HS_SIZE 1024
#endif


#define EP_IS_ISO(otg, ep) 	(((otg->epo[ep & 0x7F].DOEPCTL >> 18) & 3) == 1)

static void usb_hs_phyc_init();
static void usb_reset(USB_OTG_t  *);

typedef struct {
    usbd_t *usbd;
    USB_OTG_t *otg;

    int rx_fifo_sz;
    int bufsize;
    int bufnext;

    char readflag;

} usbotg_t;

static usbotg_t usbdev[N_USBD];

// unit 0 -> FS, 1 -> HS
// flags:
#define FLAG_HS_INTERNAL	0 // FS or HS
#define FLAG_HS_ULPI		1
#define FLAG_HS_FS		4 // full-speed on HS phy

static void
_wait(int cnt){
    while(cnt-->0){
        __asm("nop");
    }
}




void *
usb_init(struct Device_Conf *dev, usbd_t *usbd){
    int i    = dev->unit;
    int irq, cnt;
    const char *name;
    int mode = dev->flags;
    int phy   = 3; // default: internal FS PHY

    bzero(usbdev + i, sizeof(usbotg_t));
    usbdev[i].usbd = usbd;

    switch(dev->unit){
    case 0: // FS
        usbdev[i].otg = USB_OTG_FS_PERIPH_BASE;
        usbdev[i].bufsize = USB_FS_FIFOSIZE;
        usbdev[i].rx_fifo_sz = RX_FIFO_FS_SIZE;
        irq = USB_FS_IRQN;
        _usb_otg_fs_init();
        name = "otgfs/fsphy";
        break;

#ifdef USB_OTG_HS_PERIPH_BASE
    case 1: // HS
        usbdev[i].otg = USB_OTG_HS_PERIPH_BASE;
        usbdev[i].bufsize = USB_HS_FIFOSIZE;
        usbdev[i].rx_fifo_sz = RX_FIFO_HS_SIZE;
        irq = USB_HS_IRQN;
        _usb_otg_hs_init();
        name = "otghs/fsphy";

        // is there an internal HS PHY? (F7x3)
# ifdef USBPHYC_BASE
        // XXX F732 has the phyc  but no phy (ulpi only)
        // (is a 732 a 733 that failed QA?)

        if( USBPHYC->LDO & 1 ){
            usb_hs_phyc_init();
            if( mode & FLAG_HS_FS ){
                name = "otghs/hsphy/fs";
                phy = 1; // FS on HS phy
            }else{
                name = "otghs/hsphy/hs";
                phy = 0; // HS on HS phy
            }
        }

# elif defined(USB_HSPHY_INTERNAL)
        // U59, U5A, ...

        if( mode & FLAG_HS_FS ){
            name = "otghs/hsphy/fs";
            phy = 1; // FS on HS phy
        }else{
            name = "otghs/hsphy/hs";
            phy = 0; // HS on HS phy
        }

# endif
        break;
#endif
    }


    USB_OTG_t *otg = usbdev[i].otg;

    /* wait for idle */
    while( otg->g.GRSTCTL & USB_OTG_GRSTCTL_AHBIDL == 0 ) {}

    if( dev->unit == 1 ){ // OTG-HS
        otg->g.GCCFG &= ~USB_OTG_GCCFG_PWRDWN;

#ifdef USB_HSPHY_INTERNAL
        otg->g.GUSBCFG = USB_OTG_GUSBCFG_FDMOD |
            (9 << 10) | 4; /* trdt = minimum */
        otg->g.GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL;

        otg->g.GCCFG |= (1 << 23) | (1 << 24); // VBVALOVEN, VBVALOVAL

#else
        if( phy == 3 ){
            otg->g.GUSBCFG = USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL // enable FS-phy
                //QQQ | (1 << 15) //USB_OTG_GUSBCFG_PHYLPCS
                | (9 << 10) | 4; /* trdt = minimum */
            _wait(168*25000);
        }else{
            // this bit is not documented:
            otg->g.GCCFG |= 1 << 23; // enable HS-phy

            otg->g.GUSBCFG = USB_OTG_GUSBCFG_FDMOD |
                // internal HS via utmi, 480MHz
                (9 << 10) | 4; /* trdt = minimum */
        }

        // XXX - F7 only?
        otg->g.GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL;

        if( phy == 3 ){
            otg->g.GCCFG |= USB_OTG_GCCFG_PWRDWN
# ifdef NOVBUSSENS
                // the newer + older usb peripherals have inverse behaviour of this bit
                | (1 << 21)  // AKA - VBDEN(newer periph) or NOVBUSSENS(older periph)
                // NB - several other bits in this register also vary, but not used in this code
# endif
                ;
        }
#endif

    }else{ // OTG-FS
        /* select internal PHY, device mode */
        otg->g.GUSBCFG = USB_OTG_GUSBCFG_FDMOD | USB_OTG_GUSBCFG_PHYSEL |
            (9 << 10) | 4; /* trdt = minimum */
        /* override Vbus sense */
        otg->g.GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL;
        /* activate transceiver */
        otg->g.GCCFG = USB_OTG_GCCFG_PWRDWN
#ifdef NOVBUSSENS
            // the newer + older usb peripherals have inverse behaviour of this bit
            | (1 << 21)  // AKA - VBDEN(newer periph) or NOVBUSSENS(older periph)
            // NB - several other bits in this register also vary, but not used in this code
#endif
            ;
    }

    usb_reset(otg);

    /* restart phy */
    otg->PCGCCTL &= ~0xFF;
    /* soft disconnect device */
    otg->d.DCTL |= USB_OTG_DCTL_SDIS;
    /* Setup USB FS speed and frame interval */
    otg->d.DCFG = (otg->d.DCFG & ~(USB_OTG_DCFG_PERSCHIVL | USB_OTG_DCFG_DSPD))
        | (0 << USB_OTG_DCFG_PERSCHIVL_Pos)
        | (2 << USB_OTG_DCFG_PFIVL_Pos)		// end-of-frame = 90%
        | (phy << USB_OTG_DCFG_DSPD_Pos);

    /* unmask interrupts */
    otg->d.DIEPMSK = USB_OTG_DIEPMSK_XFRCM;
    otg->g.GINTMSK  = USB_OTG_GINTMSK_USBRST |
        // USB_OTG_GINTMSK_ENUMDNEM | USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_WUIM |
        USB_OTG_GINTMSK_IISOIXFRM |
        USB_OTG_GINTMSK_IEPINT | USB_OTG_GINTMSK_RXFLVLM |
        USB_OTG_GINTMSK_EOPFM
        //USB_OTG_GINTMSK_SOFM
        ;

    /* clear pending interrupts */
    otg->g.GINTSTS = 0xFFFFFFFF;
    /* unmask global interrupt */
    otg->g.GAHBCFG = USB_OTG_GAHBCFG_GINT | USB_OTG_GAHBCFG_TXFELVL;

    // QQQ - fifo sizes?
    /* setting max RX FIFO size */
    otg->g.GRXFSIZ = (usbdev[i].rx_fifo_sz >> 2);
    /* setting up EP0 TX FIFO SZ */
    otg->g.DIEPTXF0_HNPTXFSIZ = (usbdev[i].rx_fifo_sz >> 2) | ((CONTROL_SIZE >> 2) << 16);

    usbdev[i].bufnext = usbdev[i].rx_fifo_sz + CONTROL_SIZE;

