jaw0/osj5/src/machdep/arm_cm/stm32/src/usb_otg.c
    nvic_enable( irq, IPL_DISK );

    bootmsg("usb%d otg device %s @%x irq %d cid %x\n", i, name, otg, irq, otg->g.CID);

    trace_init();
    trace_crumb1("usbotg", "init", usbdev + i);

    return usbdev + i;
}

static void
usb_reset(USB_OTG_t  *otg){
    int cnt;

    /* wait for idle */
    while( (otg->g.GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0 ) {}

    otg->g.GRSTCTL |= USB_OTG_GRSTCTL_CSRST;
    cnt = 0;
    while( otg->g.GRSTCTL & USB_OTG_GRSTCTL_CSRST ) {
        if( cnt++ > 10000 ) break;
    }

}


#ifdef USBPHYC_BASE
static void
usb_hs_phyc_init(){
    int cnt;

    RCC->APB2ENR |= 1 << 31; // HS PHY
    RCC->AHB1ENR |= 1 << 30; // ulpi (NB - must not be enabled if using the FS phy)

    // enable ldo
    // the manual says "1 = disable LDO". the manual is wrong.
    USBPHYC->LDO |= (1 << 2);
    // wait for it
    while( (USBPHYC->LDO & (1<<1)) == 0 ){
        if( cnt++ > 500000 ) break;
    }

#if HSECLOCK == 12000000
    USBPHYC->PLL1 = 0;
#elif HSECLOCK == 12500000
    USBPHYC->PLL1 = 1 << 1;
#elif HSECLOCK == 16000000
    USBPHYC->PLL1 = 3 << 1;
#elif HSECLOCK == 24000000
    USBPHYC->PLL1 = 4 << 1;
#elif HSECLOCK == 25000000
    USBPHYC->PLL1 = 5 << 1;
#else
#  error "unsupported HSE frequency"
#endif

    USBPHYC->TUNE = 0x00000F13;

    // enable pll
    USBPHYC->PLL1 |= 1;
    // wait a "little while" (hardware botch - no bit to test)
    for(cnt=0; cnt<500000; cnt++){
        __asm("nop");
    }
}
#else
static void
usb_hs_phyc_init(){}
#endif

static int
pma_alloc(usbotg_t *u, int size){
    int p = u->bufnext;
    u->bufnext += size;

    if( u->bufnext >= u->bufsize ){
        kprintf("usb pma full! size %d, nxt %x\n", size, u->bufnext);
        return -1;
    }
    return p;
}

static inline void
set_pma_tx(usbotg_t *u, int epa, int addr, int cnt){

    // nb. the manual is wrong. size + addr are in units of words
    u->otg->g.DIEPTXF[epa - 1] = ((cnt >> 2) << 16) | (addr >> 2);
    trace_crumb2("usbotg", "pma", epa, addr);
}

int
usb_speed(usbd_t *u){
    usbotg_t * usb = u->dev;

    switch( (usb->otg->d.DSTS & 6) >> 1 ){
    case 3:
        // this is the only value listed in the documentation (RM0431)
        return USB_SPEED_FULL;
    case 2:
        return USB_SPEED_LOW;
    case 1:
        return USB_SPEED_FULL; // FS on HS phy?
    case 0:
        return USB_SPEED_HIGH;
    }
}

uint64_t
usb_serialnumber(void){
    return fnv64_hash(R_UNIQUE, 12);
}

int
usb_connect(usbd_t *u){
    usbotg_t * usb = u->dev;
    trace_crumb3("usbotg", "connect", u, usb, usb->otg);
    usb->otg->d.DCTL &= ~USB_OTG_DCTL_SDIS;
    u->curr_state = USBD_STATE_CONNECT;
}

int
usb_disconnect(usbd_t *u){
    usbotg_t * usb = u->dev;
    usb->otg->d.DCTL |= USB_OTG_DCTL_SDIS;
    u->curr_state = USBD_STATE_INACTIVE;
}

void
usb_enable_suspend(usbd_t *u){
    usbotg_t * usb = u->dev;
    usb->otg->g.GINTMSK |= USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_WUIM;
}

void
usb_set_addr1(usbd_t *u, int addr){
    usbotg_t * usb = u->dev;

    usb->otg->d.DCFG = (usb->otg->d.DCFG & ~USB_OTG_DCFG_DAD) | (addr << 4);

    // trace_reset();
    trace_crumb1( "usbotg", "addr", addr );
}

void
usb_set_addr2(usbd_t *u, int addr){
    // nop
}

void
usb_stall(usbd_t *u, int ep){
    usbotg_t * usb = u->dev;
    int epa = ep & 0x7f;

    trace_crumb1("usbotg", "stall", ep);

    if( ep & 0x80 ){
        usb->otg->epi[epa].DIEPCTL |= USB_OTG_DIEPCTL_STALL;
    }else{
        usb->otg->epo[epa].DOEPCTL |= USB_OTG_DOEPCTL_STALL;
    }
}

void
usb_unstall(usbd_t *u, int ep){
    usbotg_t * usb = u->dev;
    int epa = ep & 0x7f;

    if( ep & 0x80 ){
        usb->otg->epi[epa].DIEPCTL = (usb->otg->epi[epa].DIEPCTL & ~USB_OTG_DIEPCTL_STALL) |
            USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_SNAK;
    }else{
        usb->otg->epo[epa].DOEPCTL = (usb->otg->epo[epa].DOEPCTL & ~USB_OTG_DOEPCTL_STALL) |
            USB_OTG_DOEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_CNAK;
    }
}

int
usb_isstalled(usbd_t *u, int ep){
    usbotg_t * usb = u->dev;
    int epa = ep & 0x7f;

    if( ep & 0x80 ){
        return usb->otg->epi[epa].DIEPCTL & USB_OTG_DIEPCTL_STALL;
    }
    return usb->otg->epo[epa].DOEPCTL & USB_OTG_DOEPCTL_STALL;
}

static void
usb_config_ep0(usbd_t *u){
    usbotg_t *usb = u->dev;

    trace_crumb0("usbotg", "cf0");

    /* enabling RX and TX interrupts from EP0 */
    usb->otg->d.DAINTMSK |= 0x00010001;
    /* setting up EP0 TX and RX registers */
    usb->otg->epi[0].DIEPCTL = USB_OTG_DIEPCTL_SNAK;
    /* 1 setup packet, 1 packets total */
    usb->otg->epo[0].DOEPTSIZ = CONTROL_SIZE | (1 << 29) | (1 << 19);
    usb->otg->epo[0].DOEPCTL  = USB_OTG_DOEPCTL_EPENA | USB_OTG_DOEPCTL_CNAK;

    u->epd[0].bufsize = CONTROL_SIZE;

}


int
usb_config_ep(usbd_t *u, int ep, int type, int size){
    usbotg_t *usb = u->dev;
    USB_OTG_t *otg = usb->otg;
    int epa = ep & 0xF;

    u->epd[epa].bufsize = size;

    trace_fdata("usbotg", "epcf %d type %d size %d", 3, ep, type, size);

    if (ep & 0x80) {
        int buf;
        int asize = size;

        if( type == UE_ISOCHRONOUS ){
            asize <<= 1;
        }

        buf = pma_alloc(usb, asize);
        if( buf == - 1 ) return -1;

        set_pma_tx(usb, epa, buf, asize);

        otg->d.DAINTMSK |= (1 << epa);	// enable TX interrupt

        switch( type ){
        case UE_ISOCHRONOUS:
            otg->epi[epa].DIEPCTL = /*USB_OTG_DIEPCTL_EPENA |*/ USB_OTG_DIEPCTL_CNAK |
                USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DIEPCTL_USBAEP |
                           (1 << 18) | (epa << 22) | size;
            break;
        case UE_BULK:
            otg->epi[epa].DIEPCTL = USB_OTG_DIEPCTL_SNAK |
                USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DIEPCTL_USBAEP |
                            (2 << 18) | (epa << 22) | size;
            break;
        default:
            otg->epi[epa].DIEPCTL = USB_OTG_DIEPCTL_SNAK |
                USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DIEPCTL_USBAEP |
                            (3 << 18) | (epa << 22) | size;
            break;
        }

