jaw0/osj5/src/machdep/arm_cm/stm32/src/usb_otg.c
        trace_crumb2("usbotg", "cftx", ep, otg->epi[epa].DIEPCTL);

    }else{
        int t;
        switch( type ){
        case UE_ISOCHRONOUS:
            t = 1; break;
        case UE_BULK:
            t = 2; break;
        default:
            t = 3; break;
        }

        otg->d.DAINTMSK |= 1 << (epa + 16);	// enable RX interrupt

        otg->epo[epa].DOEPCTL = USB_OTG_DOEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_CNAK |
            /*USB_OTG_DOEPCTL_EPENA |*/ USB_OTG_DOEPCTL_USBAEP |
            (t << 18) | size;

    }

    return 0;
}

static uint32_t *
get_fifo(usbotg_t *u, int epa){
    // fifo is uint32[] - <<(12 - 2)
    return u->otg->fifo + (epa << 10);
}

static void
_iso_cancel(USB_OTG_t *otg, int ep){

    if( otg->epi[ep].DIEPCTL & USB_OTG_DIEPCTL_EPENA ){
        // cancel pending xfer
        otg->epi[ep].DIEPCTL |= USB_OTG_DIEPCTL_SNAK;
        otg->epi[ep].DIEPCTL |= USB_OTG_DIEPCTL_EPDIS;

        // wait for disabled
        while( (otg->epi[ep].DIEPINT & (1<<1)) == 0 ) {}
        otg->epi[ep].DIEPINT |= 1<<1;

        // flush pending xfer
        otg->g.GRSTCTL = (ep << 6) | USB_OTG_GRSTCTL_TXFFLSH;
    }
}


static void
_iso_prepare(USB_OTG_t *otg, int ep){

    // set even/odd to match most recent SOF
    int frn = (otg->d.DSTS >> 8) & 0x3FFF;
    if( !(frn & 1) ){
        otg->epi[ep].DIEPCTL |= 1 << 29; // -> odd
    }else{
        otg->epi[ep].DIEPCTL |= 1 << 28; // -> even
    }

    if( otg->epi[ep].DIEPINT & (1<<4) ){
        // already missed the in token
        trace_crumb0("usbotg", "IITXFE");
    }
    
}

int
usb_send(usbd_t *u, int ep, const char *buf, int len){
    usbotg_t *usb = u->dev;
    USB_OTG_t *otg = usb->otg;

    ep &= 0x7F;
    if( len > u->epd[ep].bufsize ) len = u->epd[ep].bufsize;

    if( EP_IS_ISO(otg, ep) ){
        _iso_cancel(otg, ep);
        _iso_prepare(otg, ep);
    }

    if( ep && !(otg->epi[ep].DIEPCTL & USB_OTG_DIEPCTL_USBAEP) ) return -3;	// ep not enabled
    if( ep &&  (otg->epi[ep].DIEPCTL & USB_OTG_DIEPCTL_EPENA) )  return -2;	// ep currently sending

    volatile uint32_t *fifo = get_fifo(usb, ep);

    trace_fdata("usbotg", "send %d len %d; diepint %x, dtxfsts %x, fifo %x", 5, ep, len, otg->epi[ep].DIEPINT, otg->epi[ep].DTXFSTS, fifo);
    trace_crumb3("usbotg", "send", otg->epi[ep].DIEPTSIZ, otg->epi[ep].DIEPCTL, otg->g.DIEPTXF[ep - 1]);

    otg->epi[ep].DIEPTSIZ = 0;
    otg->epi[ep].DIEPTSIZ = (1 << 19) | len;
    otg->epi[ep].DIEPCTL  = (otg->epi[ep].DIEPCTL & ~USB_OTG_DIEPCTL_STALL) | USB_OTG_DIEPCTL_EPENA | USB_OTG_DIEPCTL_CNAK;
    trace_crumb4("usbotg", "send", otg->epi[ep].DIEPTSIZ, otg->epi[ep].DIEPCTL, otg->epi[ep].DTXFSTS, otg->epi[ep].DIEPINT);

    int i;
    for(i=0; i<len; i+=4){
        *fifo = buf[i] | (buf[i+1]<<8) | (buf[i+2]<<16) | (buf[i+3]<<24);
    }

    trace_crumb4("usbotg", "send", otg->epi[ep].DIEPTSIZ, otg->epi[ep].DIEPCTL, otg->epi[ep].DTXFSTS, otg->epi[ep].DIEPINT);
    return len;
}

void
usb_recv_ack(usbd_t *u, int ep){
    usbotg_t *usb = u->dev;
    USB_OTG_t *otg = usb->otg;

    trace_crumb1("usbotg", "ack", ep);

    ep &= 0x7F;

    if( EP_IS_ISO(otg, ep) ){
        // isochronous - need to manually toggle even/odd bit
        if( otg->epo[ep].DOEPCTL & (1 << 16) ){
            otg->epo[ep].DOEPCTL |= 1 << 28; // odd -> even
        }else{
            otg->epo[ep].DOEPCTL |= 1 << 29; // even -> odd
        }
    }

    otg->epo[ep].DOEPCTL |= USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA;
}

void
usb_recv_nack(usbd_t *u, int ep){
    usbotg_t *usb = u->dev;
    USB_OTG_t *otg = usb->otg;

    trace_crumb2("usbotg", "nack", ep, otg->epo[ep & 0x7f].DOEPCTL & USB_OTG_DOEPCTL_NAKSTS );
    otg->epo[ep & 0x7f].DOEPCTL |= USB_OTG_DOEPCTL_SNAK;
}
int
usb_epinfo(usbd_t *u, int ep){
    usbotg_t *usb = u->dev;
    USB_OTG_t *otg = usb->otg;

    return otg->epo[ep & 0x7f].DOEPCTL;
}


int
usb_read(usbd_t *u, int ep, char *buf, int len){
    usbotg_t *usb = u->dev;
    USB_OTG_t *otg = usb->otg;

    ep &= 0x7F;
    volatile uint32_t *fifo = get_fifo(usb, ep);

    if( !(otg->g.GINTSTS & USB_OTG_GINTSTS_RXFLVL) ) return -1; // no data in fifo

    uint32_t rxs = otg->g.GRXSTSR;
    if( (rxs & USB_OTG_GRXSTSP_EPNUM) != ep ) return -1; // data is not for this ep

    rxs = otg->g.GRXSTSP;	// same data, pop
    int l = (rxs >> 4) & 0x7FF;

    int i;
    for(i=0; i<l; ){
        uint32_t v = *fifo;
        if( i >= len ){
            i += 4;
            continue; // read and discard if no space
        }
        buf[i++] = v & 0xFF;
        buf[i++] = (v >> 8) & 0xFF;
        buf[i++] = (v >> 16) & 0xFF;
        buf[i++] = (v >> 24) & 0xFF;
    }

    usb->readflag = 1;
    return l;
}

static void
usb_drain(usbotg_t *u, int ep){
    USB_OTG_t *otg = u->otg;
    ep &= 0x7F;

    uint32_t rxs = otg->g.GRXSTSP;
    uint32_t *fifo = get_fifo(u, ep);
    int l = (rxs >> 4) & 0x7FF;

    trace_crumb2("usbotg", "drain", ep, l);

    int i;
    for(i=0; i<l; i+=4){
        uint32_t v = *fifo;
    }
}


static void
usb_tx_handler(usbotg_t *u){
    int i;

    for(i=0; i<16; i++){
        if( u->otg->epi[i].DIEPINT & USB_OTG_DIEPINT_XFRC ){
            u->otg->epi[i].DIEPINT = USB_OTG_DIEPINT_XFRC;

            trace_crumb1("usbotg", "txc", i);
            usbd_cb_send_complete(u->usbd, i);
        }
    }
}

static void
usb_iiso_handler(usbotg_t *u){
    USB_OTG_t *otg = u->otg;
    int i;

    for(i=0; i<16; i++){
        if( EP_IS_ISO(otg, i) && (otg->epi[i].DIEPCTL & USB_OTG_DIEPCTL_EPENA) ){
            // iso ep - send did not complete
            _iso_cancel(otg, i);
            u->usbd->epd[i].wpending = 0;

            trace_crumb3("usbotg", "iiso", i, otg->epi[i].DIEPCTL, otg->epi[i].DIEPINT & (1<<4)); // 4=ITTXFE

            if( otg->epi[i].DIEPINT & (1<<4) ){
                int frn = (otg->d.DSTS >> 8) & 0x3FFF;
                kprintf("iitfxe %x\n", frn);
                otg->epi[i].DIEPINT |= (1<<4); // clear iitfxe
            }
        }
    }
}


static const char *rxinfo[] = {
    "rx/0", "rx/NAK", "rx/out", "rx/out!", "rx/setup!", "rx/5", "rx/setup", "rx/7",
    "rx/8", "rx/9", "rx/A", "rx/B", "rx/C", "rx/D", "rx/E", "rx/F"
};

static void
usb_rx_handler(usbotg_t *u){

    while( u->otg->g.GINTSTS & USB_OTG_GINTSTS_RXFLVL ){

