jaw0/osj5/src/machdep/arm_cm/stm32/src/usb_otg.c
        uint32_t rxs = u->otg->g.GRXSTSR;
        int ep  = rxs & 0xF;
        int len = (rxs >> 4)  & 0x7FF;
        int pt  = (rxs >> 17) & 0xF;

        u->readflag = 0;

        trace_crumb2("usbotg", rxinfo[pt], ep, len);

        switch( pt ){
        case 2:
            usbd_cb_recv(u->usbd, ep, len);
            if( !u->readflag ) usb_drain(u, ep);
            break;
        case 6:
            usbd_cb_recv_setup(u->usbd, len);
            if( !u->readflag ) usb_drain(u, ep);
            break;
        default:
            rxs = u->otg->g.GRXSTSP; // pop + discard
        }
    }
}

static void
usb_reset_handler(usbotg_t *u){

    u->otg->g.GRSTCTL |= USB_OTG_GRSTCTL_RXFFLSH; // flush rx

    u->bufnext = u->rx_fifo_sz + CONTROL_SIZE;
    trace_crumb2("usbotg", "reset", u, u->usbd);
    usb_config_ep0(u->usbd);
    usbd_cb_reset(u->usbd);

}

static void
usb_suspend_handler(usbotg_t *u){

    if( !(u->otg->g.GINTMSK & USB_OTG_GINTMSK_USBSUSPM) ) return;

    trace_crumb1("usbotg", "susp", 0);
    usbd_cb_suspend(u->usbd);
}

static void
usb_wakeup_handler(usbotg_t *u){

    usbd_cb_wakeup(u->usbd);
}


static void
otg_irq_handler(usbotg_t *u){
    int isr = u->otg->g.GINTSTS;

    //trace_crumb2("usbotg",  "irq!", isr, isr & u->otg->g.GINTMSK);
    //kprintf("irq %x\n", isr);

    if( isr & USB_OTG_GINTSTS_USBRST ){
        usb_reset_handler(u);
        u->otg->g.GINTSTS = USB_OTG_GINTSTS_USBRST;
    }

    if( isr & USB_OTG_GINTSTS_USBSUSP ){
        usb_suspend_handler(u);
        u->otg->g.GINTSTS = USB_OTG_GINTSTS_USBSUSP;
    }

    if( isr & USB_OTG_GINTSTS_WKUINT ){
        usb_wakeup_handler(u);
        u->otg->g.GINTSTS = USB_OTG_GINTSTS_WKUINT;
    }

    if( isr & USB_OTG_GINTSTS_IEPINT ){
        usb_tx_handler(u);
    }
    if( isr & USB_OTG_GINTSTS_RXFLVL ){
        usb_rx_handler(u);
    }
    if( isr & USB_OTG_GINTSTS_IISOIXFR ){
        usb_iiso_handler(u);
        u->otg->g.GINTSTS = USB_OTG_GINTSTS_IISOIXFR;
    }

    if( isr & USB_OTG_GINTSTS_SOF ){
        //usbd_cb_sof(u->usbd);
        u->otg->g.GINTSTS = USB_OTG_GINTSTS_SOF;
    }

    if( isr & USB_OTG_GINTSTS_EOPF ){
        usbd_cb_sof(u->usbd);
        u->otg->g.GINTSTS = USB_OTG_GINTSTS_EOPF;
    }

    //u->otg->g.GINTSTS = 0xFFFFFFFF;
}

#ifdef USB_FS_IRQ_HANDLER
void
USB_FS_IRQ_HANDLER(void){
    otg_irq_handler(usbdev + 0);
}
#endif

#ifdef USB_HS_IRQ_HANDLER
void
USB_HS_IRQ_HANDLER(void){
    otg_irq_handler(usbdev + 1);
}
#endif

// ################################################################

#ifdef KTESTING

DEFUN(usbtest, "usb test")
{

    // printf("usb: %x pma: %x\n", USB_OTG_FS_PERIPH_BASE, USB_OTG_FS->fifo);

    usb_send(usbdev[0].usbd, 0x8081, "XYZ=", 3);
    return 0;

    usb_disconnect(usbdev[0].usbd );
    sleep(1);

    trace_reset();
    usb_connect( usbdev[0].usbd );

    usleep(10000000);
    printf(".\n");
    usb_disconnect( usbdev[0].usbd );
    usleep(1000);

    trace_dump(0, 0);

    return  0;
}

DEFUN(xusbinfo, "usb test")
{

    trace_dump(0, 0);
    trace_reset();

    return 0;
}

DEFUN(usbinfo, "test")
{
    int n = 0;
    if( argc > 1 ){
        n = atoi( argv[1] );
        argc --;
        argv ++;
    }

    if( n >= N_USBD ) return -1;

    usbotg_t *u = usbdev + n;
    USB_OTG_t *otg = u->otg;

    if( !otg ) return -1;

    printf("usb %d (%x)\n", n, otg);
    printf("gccfg:   %08x\n", otg->g.GCCFG);
    printf("gahbcfg: %08x\n", otg->g.GAHBCFG);
    printf("grstctl: %08x\n", otg->g.GRSTCTL);
    printf("gotgctl: %08x\n", otg->g.GOTGCTL);
    printf("gotint:  %08x\n", otg->g.GOTGINT);
    printf("gusbcfg: %08x\n", otg->g.GUSBCFG);
    printf("gintsts: %08x\n", otg->g.GINTSTS);
    printf("gintmsk: %08x\n", otg->g.GINTMSK);
    printf("grxstsr: %08x\n", otg->g.GRXSTSR);

    printf("devsts:  %08x\n", otg->d.DSTS);	// 22,23 = DM,DP
    printf("devctl:  %08x\n", otg->d.DCTL);
    printf("devcfg:  %08x\n", otg->d.DCFG);
    printf("diepmsk: %08x\n", otg->d.DIEPMSK);
    printf("doepmsk: %08x\n", otg->d.DOEPMSK);
    printf("daintmsk:%08x\n", otg->d.DAINTMSK);
    printf("daint:   %08x\n", otg->d.DAINT);

    printf("pcgcctl: %08x\n", otg->PCGCCTL);
#ifdef USBPHYC
    printf("phyc: %x\n", USBPHYC);
    printf("pll1: %08x ldo: %08x\n", USBPHYC->PLL1, USBPHYC->LDO);
#endif

    return 0;
}

#ifdef USBPHYC
DEFUN(plltest, "")
{
    int n;
    if( argc > 1 ){
        n = atoi( argv[1] );
    }


    USBPHYC->PLL1 |= 1;
    for(n=0; n<500000; n++){
        if( USBPHYC->PLL1 & 1 ) break;
    }

    printf("n: %d\n", n);

    //USBPHYC->LDO = n;
    //sleep(1);
    printf("pll1: %08x ldo: %08x\n", USBPHYC->PLL1, USBPHYC->LDO);

    return 0;
}
#endif

DEFUN(epinfo, "test")
{
    int n = 0;
    if( argc > 1 ){
        n = atoi( argv[1] );
        argc --;
        argv ++;
    }

    usbotg_t *u = usbdev + n;
    USB_OTG_t *otg = u->otg;
    int ep = 1;

    if( argc > 1 )
        ep = atoi( argv[1] );

    printf("usb %d (%x); ep#: %d\n", n, otg, ep);
    printf("stall in %d, out %d\n",
           (otg->epi[ep].DIEPCTL & USB_OTG_DIEPCTL_STALL) ? 1 : 0,
           (otg->epo[ep].DOEPCTL & USB_OTG_DOEPCTL_STALL) ? 1 : 0 );

    printf("ctl: in %08x out %08x\n", otg->epi[ep].DIEPCTL,  otg->epo[ep].DOEPCTL);
    printf("siz: in %08x out %08x\n", otg->epi[ep].DIEPTSIZ, otg->epo[ep].DOEPTSIZ);
    printf("sts: in %x\n", otg->epi[ep].DTXFSTS);	// amount of free space in tx fifo. words
    printf("int: in %08x out %08x\n", otg->epi[ep].DIEPINT,   otg->epo[ep].DOEPINT);
    printf("txf: in %08x\n", ep ? otg->g.DIEPTXF[ep - 1] : otg->g.DIEPTXF0_HNPTXFSIZ);

    return 0;
}

#ifdef USB_OTG_HS_PERIPH_BASE
DEFUN(hstest, "test")
{
    int x;

    USB_OTG_t *otg = USB_OTG_HS_PERIPH_BASE;

#if 0
    RCC->AHB1ENR |= 1 << 29;
    // do not actually config the pins


    /* select Internal PHY */
    otg->g.GUSBCFG |= USB_OTG_GUSBCFG_PHYSEL;
    /* wait for idle */
    printf("waiting...");
    while( otg->g.GRSTCTL & USB_OTG_GRSTCTL_AHBIDL == 0 ) {
        usleep(10000);
    }
    /* reset */
    printf("waiting...");
    otg->g.GRSTCTL |= USB_OTG_GRSTCTL_CSRST;
    while( otg->g.GRSTCTL & USB_OTG_GRSTCTL_CSRST ) {
        usleep(10000);
    }
#endif

    printf("devsts: %08x\n", otg->d.DSTS);	// 22,23 = DM,DP

    gpio_init( GPIO_A11, GPIO_OUTPUT | GPIO_PUSH_PULL );
    gpio_init( GPIO_A12, GPIO_OUTPUT | GPIO_PUSH_PULL );

    gpio_set( GPIO_A11 );
    gpio_set( GPIO_A12 );

    usleep( 10000 );
    printf("devsts: %08x\n", otg->d.DSTS);	// 22,23 = DM,DP
    usleep( 10000 );

    gpio_init( GPIO_A11, GPIO_INPUT );
    gpio_init( GPIO_A12, GPIO_INPUT );

    return 0;
}
#endif

#endif

